
/*******************************************************************************
//Delay.h
//系统精确延时头文件
*******************************************************************************/

#ifndef	DELAY_H
#define	DELAY_H

/******************************************************************************
//宏
*******************************************************************************/
//宏定义
#define DELAY_TIMER                 TIM4                    //定义Delay函数使用的定时器
#define DELAY_TIMER_CLK             RCC_APB1Periph_TIM4     //定义Delay函数使用的定时器时钟
//延时间隔
#define	DELAY_US	                1000000	//延时间隔为1us
#define	DELAY_MS	                1000	//延时间隔为1ms

#define SEC_TIMING_COUNT	        1000	//1秒计数值
#define MIN_TIMING_COUNT	        120000	//2分钟计数值




/******************************************************************************
//变量
*******************************************************************************/
//延时计数值
extern __IO u32 g_ms_Timing_Count;	//ms计时
extern u32 s_Timing_Count;	//s计时






/******************************************************************************
//函数
*******************************************************************************/
//功能:	系统滴答延时初始化
void SysTick_Init_Delay(__IO uint32_t delay_l);

//功能:	系统精确ms延时函数
void Delay_ms(__IO uint16_t nTime);

//功能:	精确的us延时函数
void Delay_us(__IO uint16_t nTime);





#endif