
/*******************************************************************************
//Includes.h
//系统的头文件包含文件
//说明: 当不需要使用某个功能时，注释掉对应行.
*******************************************************************************/


#ifndef INCLUDES_H
#define INCLUDES_H


//******************************************************************************
//包含系统文件
#include <stdlib.h>                                             //系统头文件(使用malloc函数)
#include <stdio.h>                                             //系统头文件(使用printf函数)
#include <string.h>                                            //系统头文件(使用sprintf函数)
#include <math.h>                                              //系统头文件(包含数学运算函数)
#include <stdarg.h>                                             //让函数能够接收可变参数


//******************************************************************************
//包含ST库文件
#include "stm32f10x.h"
#include "stm32f10x_conf.h"     //系统配置头文件
#include "stm32f10x_it.h"


//******************************************************************************
//包含用户自定义头文件
#include "app_cfg.h"                                    //应用程序配置文件
#include "Delay.h"                                      //系统延时驱动头文件
#include "Core.h"                                       //系统核心驱动头文件

//******************************************************************************
//包含板级接口及初始化函数定义头文件
#include "WireLessModule/WireLessModule.h"              //配置无线模块的驱动头文件
#include "Device_Comm/Device_Comm.h"                    //与设备端通信的驱动头文件
#include "Server_Comm/Server_Comm.h"                    //与服务器通信的驱动头文件
#include "Print/Print.h"                                //程序调试用的驱动头文件
#include "Internal_Flash/Internal_Flash.h"              //单片机内部的flash存储的驱动头文件
#include "MCU/MCU.h"                                    //单片机初始化函数头文件

//******************************************************************************

#endif

/**********************************END OF FILE*********************************/
