
/*******************************************************************************
//Copyright(C)2018 , 蛙鸣公司
// All rights reserved.
// Version: v1.0
// Device : STM32F103C8T6
// Built  : IAR For ARM v7.70(Language: C)
// Date   : 2018-10-27
// Author : 刘锋
// Functiom:项目工程的MCU外设初始化源文件，主要包括各个使用了的外设的初始化(调用)，
    以及一些简单的初始化原函数。
*******************************************************************************/


/******************************************************************************
//包含头文件
*******************************************************************************/
#include "includes.h"




/******************************************************************************
//变量定义
*******************************************************************************/



/******************************************************************************
//函数声明
*******************************************************************************/
//函数功能: 单片机初始化函数
void  MCU_Init(void);




/******************************************************************************
//函数定义
*******************************************************************************/
//********************************************************
//函数名称: MCU_Init
//函数功能: 单片机初始化函数
//输    入: 无
//输    出: 无
//备    注: 无
//********************************************************
void  MCU_Init(void)
{
    NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2);	//使用优先级分组2
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO, ENABLE);    //开启AFIO时钟

    Debug_Init();                       //调试口初始化

    Server_Comm_Init();                 //与服务器通信相关的初始化

    Device_Comm_Init();                 //与设备端通信相关的初始化

    SPI_FLASH_Init();                   //片外FLASH的初始化

    SysTick_Init_Delay(DELAY_MS);       //初始化SysTick中断间隔为1ms

#if (SERVER_PRINTF_EN)
printf("------------------单片机各接口初始化完毕------------------\r\n");
#endif

}

//////////////////////////////END OF C文件////////////////////////////////////
